spec/cassettes/create_invalid_stripe_critique_payment.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_4CKcopdQA6TpLA
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - Bearer sk_test_mCsq5DgmBtgwjx4wrrqB64l0
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin13.1.0","publisher":"stripe","uname":"Darwin
        rivendell.i 13.3.0 Darwin Kernel Version 13.3.0: Tue Jun  3 21:27:35 PDT 2014;
        root:xnu-2422.110.17~1/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 08 Jul 2014 20:47:34 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1539'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Credentials:
      - 'true'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Max-Age:
      - '300'
      Stripe-Version:
      - '2014-05-19'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1402432485,
          "id": "cus_4CKcopdQA6TpLA",
          "livemode": false,
          "description": "34",
          "email": null,
          "delinquent": false,
          "metadata": {},
          "subscriptions": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_4CKcopdQA6TpLA/subscriptions",
            "data": [
              {
                "id": "sub_4CKcX10M49Xgsx",
                "plan": {
                  "interval": "year",
                  "name": "Annual Subscription",
                  "created": 1401370923,
                  "amount": 6999,
                  "currency": "usd",
                  "id": "annual",
                  "object": "plan",
                  "livemode": false,
                  "interval_count": 1,
                  "trial_period_days": null,
                  "metadata": {},
                  "statement_description": null
                },
                "object": "subscription",
                "start": 1402432485,
                "status": "active",
                "customer": "cus_4CKcopdQA6TpLA",
                "cancel_at_period_end": false,
                "current_period_start": 1402432485,
                "current_period_end": 1433968485,
                "ended_at": null,
                "trial_start": null,
                "trial_end": null,
                "canceled_at": null,
                "quantity": 1,
                "application_fee_percent": null,
                "discount": null,
                "metadata": {}
              }
            ]
          },
          "discount": null,
          "account_balance": 0,
          "currency": "usd",
          "cards": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_4CKcopdQA6TpLA/cards",
            "data": []
          },
          "default_card": null
        }
    http_version: 
  recorded_at: Tue, 08 Jul 2014 20:47:34 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_4CKcopdQA6TpLA/subscriptions/sub_4CKcX10M49Xgsx
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - Bearer sk_test_mCsq5DgmBtgwjx4wrrqB64l0
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin13.1.0","publisher":"stripe","uname":"Darwin
        rivendell.i 13.3.0 Darwin Kernel Version 13.3.0: Tue Jun  3 21:27:35 PDT 2014;
        root:xnu-2422.110.17~1/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 08 Jul 2014 20:47:35 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '747'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Stripe-Version:
      - '2014-05-19'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "sub_4CKcX10M49Xgsx",
          "plan": {
            "interval": "year",
            "name": "Annual Subscription",
            "created": 1401370923,
            "amount": 6999,
            "currency": "usd",
            "id": "annual",
            "object": "plan",
            "livemode": false,
            "interval_count": 1,
            "trial_period_days": null,
            "metadata": {},
            "statement_description": null
          },
          "object": "subscription",
          "start": 1402432485,
          "status": "active",
          "customer": "cus_4CKcopdQA6TpLA",
          "cancel_at_period_end": false,
          "current_period_start": 1402432485,
          "current_period_end": 1433968485,
          "ended_at": null,
          "trial_start": null,
          "trial_end": null,
          "canceled_at": null,
          "quantity": 1,
          "application_fee_percent": null,
          "discount": null,
          "metadata": {}
        }
    http_version: 
  recorded_at: Tue, 08 Jul 2014 20:47:35 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=2500&currency=usd&customer=cus_4CKcopdQA6TpLA&description=CastNotice%20Critique&metadata[user_id]=1
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - Bearer sk_test_mCsq5DgmBtgwjx4wrrqB64l0
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin13.1.0","publisher":"stripe","uname":"Darwin
        rivendell.i 13.3.0 Darwin Kernel Version 13.3.0: Tue Jun  3 21:27:35 PDT 2014;
        root:xnu-2422.110.17~1/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '106'
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Tue, 08 Jul 2014 20:47:35 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '157'
      Stripe-Version:
      - '2014-05-19'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Cache-Control:
      - no-cache, no-store
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "message": "Cannot charge a customer that has no active card",
            "type": "card_error",
            "param": "card",
            "code": "missing"
          }
        }
    http_version: 
  recorded_at: Tue, 08 Jul 2014 20:47:35 GMT
- request:
    method: get
    uri: https://js.stripe.com/v2/channel.html?stripe_xdm_c=default41639&stripe_xdm_e=http://127.0.0.1:52063&stripe_xdm_p=1
    body:
      encoding: UTF-8
      string: ''
    headers:
      Accept:
      - text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8
      Referer:
      - http://127.0.0.1:52063/calendar
      User-Agent:
      - Mozilla/5.0 (Macintosh; Intel Mac OS X) AppleWebKit/538.1 (KHTML, like Gecko)
        PhantomJS/2.0.0 Safari/538.1
      Connection:
      - Keep-Alive
      Accept-Language:
      - en-US,*
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 10 Mar 2015 19:58:40 GMT
      Server:
      - nginx
      Content-Type:
      - text/html
      Last-Modified:
      - Fri, 27 Feb 2015 00:44:32 GMT
      Etag:
      - '"54efbdf0-459"'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
      Content-Length:
      - '1113'
      Accept-Ranges:
      - bytes
      Via:
      - 1.1 varnish
      Age:
      - '2017'
      X-Served-By:
      - cache-atl6224-ATL
      X-Cache:
      - HIT
      X-Cache-Hits:
      - '4'
      Vary:
      - Accept-Encoding
      Cache-Control:
      - public, max-age=300
      Connection:
      - close
    body:
      encoding: UTF-8
      string: |
        <!doctype html>
        <html>
        <head>
        <title>Stripe Internal Communication Channel</title>
        <script>
        if ('postMessage' in window) {
          var stripeTrack = function(type) {
            var timestamp = Math.round(new Date().getTime() / 1000);
            var report = (new Image()).src = "https://q.stripe.com?event=stripejs-error&type=" +
              encodeURIComponent(type) +
              "&timestamp=" + timestamp +
              "&payment_user_agent=channel.html";
          };

          if (window.parent === window) {
            stripeTrack('ChannelParentError');
            window.Stripe = {earlyError: true};
          }
          else {
            window.onload = function() {
              var matches = window.location.search.match(/(\?|&)stripe_xdm_e=([^&]+)/);
              if (matches && matches.length >= 3) {
                var outerdomain = decodeURIComponent(matches[2]);
                try {
                  window.parent.postMessage('stripe:ack', outerdomain);
                }
                catch(e) {
                  stripeTrack('ChannelAckError-' + e.toString());
                }
              }
              else {
                stripeTrack('ChannelUrlError');
              }
            }
          }
        }
        </script>
        </head>
        <body>
        <script src="https://js.stripe.com/v2/"></script>
        </body>
        </html>
    http_version: 
  recorded_at: Tue, 10 Mar 2015 19:58:40 GMT
- request:
    method: get
    uri: https://js.stripe.com/v2/channel.html?stripe_xdm_c=default127560&stripe_xdm_e=http://127.0.0.1:64966&stripe_xdm_p=1
    body:
      encoding: UTF-8
      string: ''
    headers:
      Accept:
      - text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8
      Referer:
      - http://127.0.0.1:64966/resume/edit
      User-Agent:
      - Mozilla/5.0 (Macintosh; Intel Mac OS X) AppleWebKit/538.1 (KHTML, like Gecko)
        PhantomJS/2.0.0 Safari/538.1
      Connection:
      - Keep-Alive
      Accept-Language:
      - en-US,*
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 11 Mar 2015 20:45:10 GMT
      Server:
      - nginx
      Content-Type:
      - text/html
      Last-Modified:
      - Fri, 27 Feb 2015 00:44:32 GMT
      Etag:
      - '"54efbdf0-459"'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
      Content-Length:
      - '1113'
      Accept-Ranges:
      - bytes
      Via:
      - 1.1 varnish
      Age:
      - '934'
      X-Served-By:
      - cache-iad2143-IAD
      X-Cache:
      - HIT
      X-Cache-Hits:
      - '1'
      Vary:
      - Accept-Encoding
      Cache-Control:
      - public, max-age=300
      Connection:
      - close
    body:
      encoding: UTF-8
      string: |
        <!doctype html>
        <html>
        <head>
        <title>Stripe Internal Communication Channel</title>
        <script>
        if ('postMessage' in window) {
          var stripeTrack = function(type) {
            var timestamp = Math.round(new Date().getTime() / 1000);
            var report = (new Image()).src = "https://q.stripe.com?event=stripejs-error&type=" +
              encodeURIComponent(type) +
              "&timestamp=" + timestamp +
              "&payment_user_agent=channel.html";
          };

          if (window.parent === window) {
            stripeTrack('ChannelParentError');
            window.Stripe = {earlyError: true};
          }
          else {
            window.onload = function() {
              var matches = window.location.search.match(/(\?|&)stripe_xdm_e=([^&]+)/);
              if (matches && matches.length >= 3) {
                var outerdomain = decodeURIComponent(matches[2]);
                try {
                  window.parent.postMessage('stripe:ack', outerdomain);
                }
                catch(e) {
                  stripeTrack('ChannelAckError-' + e.toString());
                }
              }
              else {
                stripeTrack('ChannelUrlError');
              }
            }
          }
        }
        </script>
        </head>
        <body>
        <script src="https://js.stripe.com/v2/"></script>
        </body>
        </html>
    http_version: 
  recorded_at: Wed, 11 Mar 2015 20:45:10 GMT
recorded_with: VCR 2.9.3
